In [1]:
import pandas as pd

In [4]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'k3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']
                    })

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'k3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']
                    })

In [5]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  k3  A3  B3

In [6]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  k3  C3  D3

In [8]:
# On is the column that we want to merge the tables on
# it defaults to a SQL inner join
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

In [16]:
left = pd.DataFrame({
                    'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']},
                        index = ['K0', 'K1', 'K2', 'k3'])

right = pd.DataFrame({
                    'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                      index = ['K0', 'K1', 'K2', 'k3'])

In [17]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
k3  A3  B3  C3  D3